app/Http/Controllers/PostsController.php

    public function index(){

        $posts = Post::with('comments')->with('userVotes')->withSum('votes','vote')->latest()->get();
---
select * from `comments` where `comments`.`post_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11) order by `created_at` desc
select * from `votes` where `votes`.`post_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11)